# Data Cleaning

In [1]:
import pandas as pd

movies = pd.read_csv('./movielens/movies.csv')

movies.shape

(9742, 3)

In [2]:
# Is any null function

movies.isnull().any()

movieId    False
title      False
genres     False
dtype: bool

No null values

In [3]:
tags = pd.read_csv('./movielens/tags.csv')

tags.shape

(3683, 4)

In [4]:
# Is there any null in tags

tags.isnull().any()

userId       False
movieId      False
tag           True
timestamp    False
dtype: bool

We have some tag which are null

In [5]:
# Eliminate rows with missing values

tags = tags.dropna()  # dropna(axis = 0) droping the rows.
                      # dropna(axis = 1) droping the columns..
tags

      userId  movieId               tag   timestamp
0          2    60756             funny  1445714994
2          2    60756      will ferrell  1445714992
3          2    89774      Boxing story  1445715207
4          2    89774               MMA  1445715200
5          2    89774         Tom Hardy  1445715205
...      ...      ...               ...         ...
3678     606     7382         for katie  1171234019
3679     606     7936           austere  1173392334
3680     610     3265            gun fu  1493843984
3681     610     3265  heroic bloodshed  1493843978
3682     610   168248  Heroic Bloodshed  1493844270

[3681 rows x 4 columns]

In [6]:
tags.shape

(3681, 4)

In [7]:
ratings = pd.read_csv('./movielens/ratings.csv')

ratings.isnull().any()

userId       False
movieId      False
rating        True
timestamp    False
dtype: bool

In [8]:
# Replace a data

ratings.replace(4.0,3.5)

        userId  movieId  rating   timestamp
0            1        1     NaN   964982703
1            1        3     3.5   964981247
2            1        6     3.5   964982224
3            1       47     NaN   964983815
4            1       50     5.0   964982931
...        ...      ...     ...         ...
100831     610   166534     3.5  1493848402
100832     610   168248     5.0  1493850091
100833     610   168250     5.0  1494273047
100834     610   168252     NaN  1493846352
100835     610   170875     NaN  1493846415

[100836 rows x 4 columns]

In [9]:
# Fill missing Data gaps forword

ratings.fillna(method = 'ffill')

        userId  movieId  rating   timestamp
0            1        1     NaN   964982703
1            1        3     4.0   964981247
2            1        6     4.0   964982224
3            1       47     4.0   964983815
4            1       50     5.0   964982931
...        ...      ...     ...         ...
100831     610   166534     4.0  1493848402
100832     610   168248     5.0  1493850091
100833     610   168250     5.0  1494273047
100834     610   168252     5.0  1493846352
100835     610   170875     5.0  1493846415

[100836 rows x 4 columns]

In [10]:
# Fill missing Data gaps backword
ratings.fillna(method = 'backfill')

        userId  movieId  rating   timestamp
0            1        1     4.0   964982703
1            1        3     4.0   964981247
2            1        6     4.0   964982224
3            1       47     5.0   964983815
4            1       50     5.0   964982931
...        ...      ...     ...         ...
100831     610   166534     4.0  1493848402
100832     610   168248     5.0  1493850091
100833     610   168250     5.0  1494273047
100834     610   168252     NaN  1493846352
100835     610   170875     NaN  1493846415

[100836 rows x 4 columns]

In [11]:
ratings = ratings.fillna(ratings['rating'].mean())